{"filename":"index.md","title":"Apprendre à se servir de ce qu'on a","date":"2015-05-03","body":{"t":"div","c":[{"t":"p","c":["Très souvent, lorsqu'on développe un site ou une application web, l'utilisation\nd'une bibliothèque telle que jQuery ou MooTools (certes, celle-ci a, parait-il,\nperdu la guerre, mais je trouve que cette bibliothèque propose tout de même des\nchoses intéressantes) s'impose. S'impose ? Et si ce n'était finalement pas si\nobligatoire que ça ? Si on pouvait faire la même chose qu'avec jQuery, mais\nsans jQuery ?"]},"\n",{"t":"p","c":[{"t":"span","p":{"className":"more"}}]},"\n",{"t":"p","c":["Que l'on soit bien d'accord. Je ne crache pas sur jQuery ni sur ses petits\ncopains. Cette bibliothèque rend un grand service, et est de très bonne\nqualité. Seulement, jQuery n'a pas forcément d'intérêt pour tous vos projets\nweb. Et c'est précisément le problème. Un jQuery-like est souvent un choix par\ndéfaut au début d'un projet. Pourtant, les API JavaScript exposées par les\nnavigateurs suffisent à couvrir une grande variété de besoins. Cette série\nd'articles aura pour but de donner des solutions aux problèmes couramment\nrencontrés lors du développement de sites (et d'applications) web. J'évoquerais\nles sujets suivants :"]},"\n",{"t":"ul","c":["\n",{"t":"li","c":["1ère partie : introduction"]},"\n",{"t":"li","c":["2ème partie : ",{"t":"a","p":{"href":"/articles/apprendre-a-se-servir-de-ce-quon-a-manipuler-dom/"},"c":["manipuler le\nDOM"]}]},"\n",{"t":"li","c":["3ème partie : ",{"t":"a","p":{"href":"/articles/apprendre-a-se-servir-de-ce-quon-a-manipuler-styles-elements/"},"c":["manipuler le style des\néléments"]}]},"\n",{"t":"li","c":["4ème partie : ",{"t":"a","p":{"href":"/articles/apprendre-a-se-servir-de-ce-quon-a-animations"},"c":["faire des\nanimations"]}]},"\n",{"t":"li","c":["5ème partie : ",{"t":"a","p":{"href":"/articles/apprendre-a-se-servir-de-ce-quon-a-event-delegation"},"c":["la délégation\nd'événements"]}]},"\n",{"t":"li","c":["6ème partie : ",{"t":"a","p":{"href":"/articles/apprendre-a-se-servir-de-ce-quon-a-ajax/"},"c":["AJAX"]}]},"\n"]},"\n",{"t":"p","c":["Les liens ci-dessus seront mis à jour au fur et à mesure de la publication de\nchaque partie."]},"\n",{"t":"p","c":["Je m'efforcerais de donner des solutions compatibles avec Internet Explorer 8\net plus, ainsi que les navigateurs dits \"récents\" (Firefox, Chrome, Safari,\nOpera...). Les très vieilles versions d'Internet Explorer ne sont quasiment\nplus utilisées et, selon moi, freinent grandement nos développements qui\ndoivent être compatibles avec elles. Je m'épargnerais cela pour ces articles."]},"\n",{"t":"p","c":["Parfois, les solutions passeront par la mise en place de polyfills. C'est\npourquoi je tiens à présenter ce concept dans cette introduction, pour ceux qui\nne sauraient pas ce que c'est. Un polyfill est un script JavaScript qui a pour\nbut de simuler une fonctionnalité dans un navigateur qui ne la propose pas de\nmanière native. Par exemple, IE8 ne propose pas l'objet ",{"t":"code","c":["console"]},". On peut donc\nexécuter un script qui lui ajoutera cet objet (pour ceux que ça intéresse, il y\nen a un qui est disponible ",{"t":"a","p":{"href":"https://github.com/paulmillr/console-polyfill"},"c":["sur\ngithub"]},")."]},"\n",{"t":"p","c":["Pour trouver un polyfill, c'est très simple. Il suffit de taper dans son moteur\nde recherche favoris \"polyfill [fonctionnalité recherchée]\" (exemple: \"polyfill\nconsole\"). Sachez que le ",{"t":"a","p":{"href":"https://developer.mozilla.org/fr/"},"c":["Mozilla Developer Network\n(MDN)"]}," propose très souvent des polyfills\nsur ses pages de documentation de fonctions / méthodes."]},"\n",{"t":"p","c":["Un dernier point sur les polyfills. Il existe un service permettant de les\nrécupérer à la demande. Je ne l'ai encore jamais utilisé, mais vous pouvez\naller voir ça ",{"t":"a","p":{"href":"https://github.com/Financial-Times/polyfill-service"},"c":["par ici"]},"."]},"\n",{"t":"p","c":["Voilà pour l'introduction de cette série d'articles."]}]}}