{"filename":"index.md","title":"Résoudre le problème de crochet et d'accolade fermant(e) sur Atom","date":"2016-03-01","timeSensitive":true,"body":{"t":"div","c":[{"t":"p","c":["Lorsqu'on utilise un clavier français (mais pas que) sur Atom, l'éditeur de\ncode initié par Github, il est impossible de taper un crochet fermant ou une\naccolade fermante. Heureusement, il existe une solution."]},"\n",{"t":"p","c":[{"t":"span","p":{"class":"more"}}]},"\n",{"t":"p","c":[{"t":"strong","c":["Edit 10/11/2016"]}," : La version 1.12.0 d'Atom est sortie aujourd'hui, et parmi\nles nouveautés qu'elle propose (voir les ",{"t":"a","p":{"href":"https://github.com/atom/atom/releases/tag/v1.12.0"},"c":["notes de release sur\nGithub"]},") , on trouve le\nsupport de tous les layouts de claviers. De leur propre aveux, c'est une\nfonctionnalité qui était demandée depuis longtemps (2014). L'équipe a toutefois\nécrit un ",{"t":"a","p":{"href":"http://blog.atom.io/2016/10/17/the-wonderful-world-of-keyboards.html"},"c":["article sur son\nblog"]},"\npour expliquer pourquoi cette fonctionnalité a été complexe à implémenter\nefficacement. Le problème est donc résolu est il n'y a plus besoin d'installer\nde package pour qu'Atom gère le layout de clavier français."]},"\n",{"t":"p","c":["Le problème est connu depuis 2014 et est lié à la gestion de la touche \"ALT\nGR\", comme l'indique ",{"t":"a","p":{"href":"https://github.com/atom/atom-keymap/issues/35"},"c":["cette\nissue"]},"."]},"\n",{"t":"p","c":["En parcourant les commentaires, on tombe sur pas mal de solutions plus ou moins\npropres qui requièrent d'éditer un fichier de configuration. J'en ai essayé\nplusieurs, sans succès."]},"\n",{"t":"p","c":["Je suis finalement tombé sur le package\n",{"t":"a","p":{"href":"https://atom.io/packages/keyboard-localization"},"c":["keyboard-localization"]},", qui\npermet de régler ces soucis sur de nombreuses dispositions de claviers, dont le\nbon vieux AZERTY français. Il suffit d'installer le package, puis d'aller dans\nla configuration de celui-ci et de sélectionner la langue qui vous convient\n(fr_FR dans mon cas, par exemple)."]},"\n",{"t":"p","c":["Voilà. C'est certes un peu drôle d'avoir à installer un package pour avoir une\ngestion correcte de son clavier, mais les développeurs d'Atom sont au courant\ndonc il y a de fortes chances qu'une mise à jour réglant le problème finisse\npar arriver."]}]}}