{"filename":"index.md","title":"Bye bye Tumblr !","date":"2015-03-15","body":{"t":"div","c":[{"t":"p","c":["En ce moment, je m'interesse pas mal à tout ce qui touche à la perte de\ncontrôle sur nos données personnelles (ou privées, c'est selon comment qu'on\naime dire, comme dirait l'autre). Et mon apprentissage a débuté avec la\npublication du livre de Tristan Nitot (ex directeur de Mozilla Europe,\naujourd'hui C3PO : Cozy Cloud Chief Product Officer) sur ",{"t":"a","p":{"href":"http://standblog.org/blog/serie/flicage-brouillon"},"c":["son\nblog"]},"."]},"\n",{"t":"p","c":[{"t":"span","p":{"class":"more"}}]},"\n",{"t":"p","c":["Dans ce livre, Tristan Nitot nous explique qu'aujourd'hui le web tend à être\ncentralisé. C'est à dire que de très (très) gros services comme Facebook,\nDropbox, Skype et plein d'autres s'approprient les données de nombreux\nutilisateurs (un milliard pour Facebook, par exemple) et s'en servent pour\nproposer de la publicité ciblée à des annonceurs. Pour éviter celà, une méthode\nproposée est de créer son propre blog afin d'y poster ses humeurs, photos,\nvidéos et de l'auto-héberger. Je ne vais pas vous refaire tout le livre, filez\nplutôt le lire et profitez-en pour faire des commentaires qui permettront à Mr\nNitot de l'améliorer encore."]},"\n",{"t":"p","c":["Face à tout ça, ma réaction n'a pas été de quitter Facebook. Bien qu'assez\ndétâché de ce service, j'y accorde tout de même une certaine importance dans le\nsens où c'est mon seul moyen de communication avec certaines personnes. Ne\nparlons pas de Twitter, qui est mon moyen de veille technologique numéro 1.\nNon, face à tout ça, ma réaction a plutôt été de me dire \"eh, tu as un blog,\nmais il est chez Tumblr, qui est un service participant à la centralisation\nd'Internet\". J'ai donc décidé de prendre les quelques articles que j'avais\npublié sur Tumblr, et de faire mon propre blog, auto-hébergé."]},"\n",{"t":"p","c":["Après quelques recherches, je me suis tourné vers\n",{"t":"a","p":{"href":"http://wintersmith.io/"},"c":["Wintersmith"]}," pour générer un site statique à partir de\nquelques fichiers Markdown. Ce système est vraiment pratique et convient\nparfaitement à mes besoins très simples."]},"\n",{"t":"p","c":["Tout était bon. Jusqu'à ce que je cherche à exporter mes articles Tumblr. Je\nvais la faire courte : je n'ai pas trouvé la fonctionnalité, et mes recherches\nn'ont pas donné de méthode simple pour exporter les articles d'un blog Tumblr.\nTypique d'un service qui cherche à enfermer ses utilisateurs. Je suis chanceux,\nmon blog, qui a bientôt un an, ne comporte que 5 articles. Les exporter à la\nmain n'a donc pas été compliqué. Mais j'éprouve de la pitié pour ceux qui\nvoudront fermer leur blog sur Tumblr pour en ouvrir un auto-hébergé, et qui\nauront des centaines d'articles à exporter. Ma mauvaise vision de ce service a\ndonc été accrue avec cette expérience."]},"\n",{"t":"p","c":["Bref, depuis aujourd'hui mon blog m'appartient entièrement. On se sent quand\nmême plus libre comme ça. J'invite tout le monde à faire de même."]},"\n",{"t":"p","c":["Bon, pour le moment mon hébergeur est Github, grâce à ses Github Pages. Mais ça\nne saurait durer, je vais très rapidement mettre en place mon propre\nhébergement. Car Github ",{"t":"a","p":{"href":"http://framablog.org/2015/03/13/google-code-ferme-ses-portes-nous-on-les-ouvre/"},"c":["est aussi un service participant à la centralisation\ndu\nweb"]},".\nToujours est-il que même si Github ferme ou si je décide de le quitter, il me\nsuffira de mettre mon blog ailleurs pour qu'il soit toujours accessible. Ce qui\nn'était pas le cas de Tumblr. Bye bye Tumblr !"]}]}}