{"filename":"index.md","title":"LessPass, pour avoir des mots de passe solides sans avoir à s'en souvenir","headings":[{"level":2,"text":"Qu'est-ce que LessPass ?","id":"quest-ce-que-lesspass-"},{"level":2,"text":"Comment l'installer ?","id":"comment-linstaller-"},{"level":2,"text":"Comment l'utiliser ?","id":"comment-lutiliser-"},{"level":2,"text":"Pour finir","id":"pour-finir"}],"date":"2016-11-22","body":{"t":"div","c":[{"t":"p","c":["Pour ne pas se faire pirater un compte important (mail, réseaux sociaux...), il\nfaut respecter des règles bien précises pour nos mots de passe : ne pas\nutiliser deux fois le même, varier les caractères, former un mot de passe assez\nlong... Respecter toutes ces règles et se souvenir parfaitement de tous nos\nmots de passe de tête est extrêmement compliqué. LessPass permet de régler ce\nproblème."]},"\n",{"t":"h2","p":{"id":"quest-ce-que-lesspass-"},"c":[{"t":"a","p":{"aria-hidden":"true","href":"#quest-ce-que-lesspass-"},"c":[{"t":"span","p":{"class":"icon icon-link"}}]},"Qu'est-ce que LessPass ?"]},"\n",{"t":"p","c":[{"t":"a","p":{"href":"https://lesspass.com/"},"c":["LessPass"]}," est un gestionnaire de mots de passe. A ce\nmoment-là, vous devez vous dire qu'il en existe déjà\n",{"t":"a","p":{"href":"https://www.lastpass.com/"},"c":["des"]}," ",{"t":"a","p":{"href":"http://keepass.info/"},"c":["tas"]},"\n",{"t":"a","p":{"href":"https://www.dashlane.com/"},"c":["d'autres"]},", et vous demander quel est l'intérêt d'en\ncréer un nouveau."]},"\n",{"t":"p","c":["La particularité de LessPass réside dans le fait que celui-ci est basé sur une\nfonction pure (c'est à dire que lorsqu'on l'invoque plusieurs fois en lui\npassant les mêmes paramètres, elle renvoit toujours le même résultat), ce qui\nlui permet de ne jamais avoir à stocker vos mots de passe dans une base de\ndonnées. Il n'y a donc pas de base de données qui peut être compromise, et il\nn'y a pas besoin de synchroniser cette base entre vos différents devices. Le\nfonctionnement interne de LessPass est très bien détaillé dans ",{"t":"a","p":{"href":"https://blog.lesspass.com/lesspass-how-it-works-dde742dd18a4#.f4ovto7cj"},"c":["un article sur\nle blog\nofficiel"]},"."]},"\n",{"t":"h2","p":{"id":"comment-linstaller-"},"c":[{"t":"a","p":{"aria-hidden":"true","href":"#comment-linstaller-"},"c":[{"t":"span","p":{"class":"icon icon-link"}}]},"Comment l'installer ?"]},"\n",{"t":"p","c":["LessPass propose des extensions pour\n",{"t":"a","p":{"href":"https://addons.mozilla.org/en-US/firefox/addon/lesspass/"},"c":["Firefox"]}," et pour\n",{"t":"a","p":{"href":"https://chrome.google.com/webstore/detail/lesspass/lcmbpoclaodbgkbjafnkbbinogcbnjih"},"c":["Chrome"]},",\nune ",{"t":"a","p":{"href":"https://github.com/lesspass/cozy"},"c":["application Cozy"]},", un ",{"t":"a","p":{"href":"https://github.com/lesspass/cli"},"c":["outil en ligne de\ncommande"]},". Si aucune de ces solutions ne vous\nconvient, il reste toujours le ",{"t":"a","p":{"href":"https://lesspass.com/"},"c":["site officiel"]},", mais\nLessPass conseille d'utiliser une solution installée en local pour des raisons\nde sécurité. L'outil est donc disponible pour vous, quels que soient votre\nmachine, OS, navigateur..."]},"\n",{"t":"h2","p":{"id":"comment-lutiliser-"},"c":[{"t":"a","p":{"aria-hidden":"true","href":"#comment-lutiliser-"},"c":[{"t":"span","p":{"class":"icon icon-link"}}]},"Comment l'utiliser ?"]},"\n",{"t":"p","c":["Je ne parlerais ici que de l'extension Firefox, puisque c'est celle que\nj'utilise. Mais le fonctionnement des autres solutions que propose LessPass est\nle même."]},"\n",{"t":"p","c":["Une fois l'extension installée, l'icône de LessPass (une clef dans un losange\nbleu) s'affiche en haut à drotie de votre navigateur. Au click sur cette icône,\nl'interface s'affiche :"]},"\n",{"t":"p","c":[{"t":"img","p":{"src":"/posts/lesspass/01.png","alt":"Interface de LessPass"}}]},"\n",{"t":"p","c":["Cette interface est très simple. Par défaut, le premier champ reprend le\ndomaine du site sur lequel vous vous trouvez. Le deuxième champ correspond au\nlogin que vous utilisez sur ce site. Le troisième champ correspond à votre\nmaster password, ou mot de passe principal. C'est le seul dont vous devrez vous\nsouvenir pour pouvoir retrouver tous vos autres mots de passe générés par\nLessPas. Il est donc conseillé d'avoir un master password complexe."]},"\n",{"t":"p","c":["Grâce à ces trois informations, et avec les options qui se trouvent tout en bas\nde l'interface (longueur, caractères, itérations), un mot de passe est généré.\nTant que vous fournirez les mêmes entrées et les mêmes paramètres, le meme mot\nde passe vous sera fournit."]},"\n",{"t":"p","c":[{"t":"img","p":{"src":"/posts/lesspass/02.png","alt":"Interface de LessPass avec toutes les informations remplies"}}]},"\n",{"t":"p","c":["Il ne reste plus qu'à copier/coller le mot de passe généré dans votre\nformulaire de login ou d'inscription, et le tour est joué."]},"\n",{"t":"h2","p":{"id":"pour-finir"},"c":[{"t":"a","p":{"aria-hidden":"true","href":"#pour-finir"},"c":[{"t":"span","p":{"class":"icon icon-link"}}]},"Pour finir"]},"\n",{"t":"p","c":["Lorsque je vous ai dit que LessPass n'utilisait pas de base de donnée pour\nstocker vos mots de passe, je vous ai à moitié menti. Il est possible\nd'utiliser une base de données. Pour cela, il faut cliquer sur l'icône qui se\ntrouve en haut à droite de l'interface. Vous pouvez alors créer un nouveau\ncompte, soit directement sur ",{"t":"a","p":{"href":"lesspass.com"},"c":["lesspass.com"]},", soit sur une\ninstance auto-hébergée. Je n'ai toutefois pas encore testé cette\nfonctionnalité, puisque le fonctionnement de base me convient pour le moment."]},"\n",{"t":"p","c":["Je vous conseille donc l'utilisation de LessPass pour gérer vos mots de passe.\nCelui-ci permet d'avoir des mots de passe complexes, différent sur chaque\nservice, et de ne pas avoir à s'en souvenir. Si vous voulez aller encore plus\nloin niveau sécurité et vie privée, je vous conseille de lire l'article suivant\nsur Medium : ",{"t":"a","p":{"href":"https://medium.freecodecamp.com/tor-signal-and-beyond-a-law-abiding-citizens-guide-to-privacy-1a593f2104c3#.i6gyeryj1"},"c":["How to encrypt your entire life in less than an\nhour"]},"\n; ainsi que les articles ",{"t":"a","p":{"href":"https://ssd.eff.org/fr"},"c":["Surveillance Self-Defense"]}," de\nl'EFF."]}]}}